### Basics of Python

Fill valid code/values in place of blanks.

# Demo
# initialize variable 'msg' with the string 'Hello World'
msg = _____

# Solution
msg = "Hello World"

In [1]:
# initialize variables 'a' and 'b' with 5 and 6 respectively
a = 5 
b = 6

# add 'a' and 'b' and assign the result into a new variable 'c'
c = a+ b
print(c)

11

In [2]:
# build a function to add 2 numbers
def addition(x,y):
    return (x + y)

# use the function 'addition' to add 'a' and 'b'
addition(5, 6)

11

In [3]:
# create a list consisting of first 5 even numbers and print the list
my_list = [2,4,6,8,10]
print(my_list)

[2, 4, 6, 8, 10]

In [4]:
# access the 3rd element of the list 'my_list'
my_list[2]

6

In [5]:
# given below is a dictionary having 4 unique keys, i.e., 'name', 'age', 'gender', 'is_employed'
my_dict = {'name':'Smith',
           'age':34,
           'gender': 'Male',
           'is_employed': False}

# print 'my_dict'
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': False}

In [6]:
# access value under 'name' key from 'my_dict'
my_dict['name']

'Smith'

In [7]:
# update 'is_employed' key to True
my_dict.update({'is_employed':True})

# print the updated dictionary
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': True}

In [8]:
# use a for loop to print only even numbers from the first 20 numbers, i.e. 1-20
for i in range(1,21):
    if i % 2 == 0:
        print(i)

2
4
6
8
10
12
14
16
18
20

### Please download the file "data_python.csv".

In [10]:
# import required libraries
import pandas as pd
import numpy as np
import os

In [11]:
## read data_python.csv using pandas
mydata = pd.read_csv("C:/Users/DIVLEEN/Desktop/DATA SCIENCE INTERNSHIP/data_python.csv") #("data_python.csv")

In [12]:
## print the number of rows and number of columns of mydata
mydata.shape

(614, 13)

In [14]:
## assign a variable 'target' with the 'Loan_Status' feature from mydata dataframe
target = mydata['Loan_Status']

In [17]:
## print the datatype of ApplicantIncome feature
print(mydata['ApplicantIncome'])

0       5849
1       4583
2       3000
3       2583
4       6000
5       5417
6       2333
7       3036
8       4006
9      12841
10      3200
11      2500
12      3073
13      1853
14      1299
15      4950
16      3596
17      3510
18      4887
19      2600
20      7660
21      5955
22      2600
23      3365
24      3717
25      9560
26      2799
27      4226
28      1442
29      3750
       ...
584     2787
585     4283
586     2297
587     2165
588     4750
589     2726
590     3000
591     6000
592     9357
593     3859
594    16120
595     3833
596     6383
597     2987
598     9963
599     5780
600      416
601     2894
602     5703
603     3676
604    12000
605     2400
606     3400
607     3987
608     3232
609     2900
610     4106
611     8072
612     7583
613     4583
Name: ApplicantIncome, Length: 614, dtype: int64

In [18]:
## conditional statement - print 'Yes' if the 21st element of 'Education' feature is 'Graduate' else print 'No'
if(mydata['Education'][20] == 'Graduate'):
    print('Yes')
else:
    print('No')

No

In [21]:
## print first 5 rows of 2nd and 3rd column only
mydata.iloc[:5,2:3]

  Married
0      No
1     Yes
2     Yes
3     Yes
4      No

In [22]:
## print 31st to 35th rows of mydata
mydata.iloc[31:36]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
31,LP001095,Male,No,0,Graduate,No,3167,0.0,74.0,360.0,1.0,Urban,N
32,LP001097,Male,No,1,Graduate,Yes,4692,0.0,106.0,360.0,1.0,Rural,N
33,LP001098,Male,Yes,0,Graduate,No,3500,1667.0,114.0,360.0,1.0,Semiurban,Y
34,LP001100,Male,No,3+,Graduate,No,12500,3000.0,320.0,360.0,1.0,Rural,N
35,LP001106,Male,Yes,0,Graduate,No,2275,2067.0,NaN,360.0,1.0,Urban,Y